{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "nB" : 9221,
      "top" : "embedding_1_output",
      "has_biases" : 0,
      "weights" : {

      },
      "nC" : 25,
      "blob_weights" : 1,
      "is_lookup" : 1,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input1",
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "embedding_1",
      "has_prelu" : 0
    },
    {
      "input_size" : 25,
      "arch" : 1,
      "hidden_size" : 200,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "coupled_input_forget" : 0,
      "lstm_forget_bias" : 1,
      "bias_vector_flag" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 50000,
      "type" : "rnn_arch",
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 3,
        "W_x" : 5,
        "b" : 7
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "lstm_1",
      "top" : "lstm_1_output,lstm_1_h_out,lstm_1_c_out",
      "alpha" : 1,
      "max_batch_size" : 1,
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 0,
      "internal_nonlinearity_type" : 3,
      "bottom" : "embedding_1_output,lstm_1_h_in,lstm_1_c_in",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "input_size" : 200,
      "arch" : 1,
      "hidden_size" : 200,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "coupled_input_forget" : 0,
      "lstm_forget_bias" : 1,
      "bias_vector_flag" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 50000,
      "type" : "rnn_arch",
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 9,
        "W_x" : 11,
        "b" : 13
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "lstm_2",
      "top" : "lstm_2_output,lstm_2_h_out,lstm_2_c_out",
      "alpha" : 1,
      "max_batch_size" : 1,
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 0,
      "internal_nonlinearity_type" : 3,
      "bottom" : "lstm_1_output,lstm_2_h_in,lstm_2_c_in",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 0,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "nB" : 200,
      "top" : "dense_1__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 200,
      "blob_weights" : 17,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "lstm_2_output",
      "blob_biases" : 15,
      "has_tanh" : 0,
      "name" : "dense_1",
      "has_prelu" : 0
    },
    {
      "nB" : 200,
      "top" : "dense_2_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 9221,
      "blob_weights" : 21,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_1__activation___output",
      "blob_biases" : 19,
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "dense_2",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_2_output",
      "weights" : {

      },
      "hint_fallback_from_metal" : 1,
      "top" : "output1",
      "C" : 2,
      "type" : "softmax",
      "name" : "dense_2__activation__"
    }
  ]
}